public/blog/how_to_org_website.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Setting up this Website with Emacs Org-mode</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css"/> <link rel="icon" href="../img_doc/favicon.png" type="image/x-icon"/>
</head>
<body>
<div id="preamble" class="status">
<nav>
  <a href="../index.html">&lt; Home</a>
</nav>
<div id="updated">Updated: 2023-04-16 Sun 14:47</div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Setting up this Website with Emacs Org-mode</h1>
</header><p>
The HTML files which make up this site were automatically generated by EMACS Org-Mode's publishing function. As a total beginner with Emacs I wanted to share my struggle creating this website so other people - maybe you - can learn from my mistakes.
</p>

<div id="outline-container-org58fc99d" class="outline-2">
<h2 id="org58fc99d">Why use ORG-Mode?</h2>
<div class="outline-text-2" id="text-org58fc99d">
<p>
Today there are a lot of (easy) ways getting your Website online. So why choose writing it in EMACS over using Wordpress for Example? My reasons at least are:
</p>

<ul class="org-ul">
<li>Browser-Editors are overkill: Wordpress and all the other are good and mighty tools. But I just want a little place in the www where I can put my writing and be found by others. I don't need forms, comment-sectins, fancy animations, selling-capability and so on. Org-Mode is perfect for a simple, text-focused website as EMACS is in its heart a text editor.</li>
<li>Cheap: Currently, I don't pay anything for this website. Not for the building-part and not for the hosting part.</li>
<li>Easy (kind of): The set up takes a few hours, but now I don't have to write any HTML or CSS when modifying or extending the site. I do everything form EMACS.</li>
<li>Fun: It's just fun exploring the capabilities of EMACS org-mode and simultaously writing for my website.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbd94b55" class="outline-2">
<h2 id="orgbd94b55">Basic setup</h2>
<div class="outline-text-2" id="text-orgbd94b55">
<p>
I use doom EMACS (v28.2) and Org mode v9.5.5. If you have never heard about EMACS or Org, you can think of EMACS as the editor and org as a kind of markup language. Org has a integrated publishing package, ox-pubish. After generating the HTML files with ox-publish into a designated website directory, I commit the changes to my remote Github repository where they automatically get posted online through Github pages.
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">editor</th>
<th scope="col" class="org-left">doom EMACS</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">markup language</td>
<td class="org-left">org-mode</td>
</tr>

<tr>
<td class="org-left">syncing</td>
<td class="org-left">git</td>
</tr>

<tr>
<td class="org-left">hosting</td>
<td class="org-left">Github (pages)</td>
</tr>
</tbody>
</table>

<pre class="example">

Website-directory
  |
  |-- content_dir
  |   |-- index.org     &lt;-- homepage org-file, gets translated to html
  |   |-- style.css
  |   |-- img_dir
  |   |-- posts_dir     &lt;-- directory with all posts
  |
  |-- public_dir        &lt;-- hosts the published html-files
  |-- build-site.el     &lt;-- publishing configuration
  |-- build.sh          &lt;-- shell script to execute build-site.el
</pre>
</div>
</div>

<div id="outline-container-org5a88c94" class="outline-2">
<h2 id="org5a88c94">Publishing configuration</h2>
<div class="outline-text-2" id="text-org5a88c94">
<p>
The following code is from the publishing file 'build-site.el', which contains all the necessary publishing instuction for org publish and enables also system independant publishing as it specifies all needed packages and downloads them if not already done.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Here the necessary dependencies are checked and if needed installed:</label><pre class="src src-emacs-lisp">(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">package</span>)
(<span style="font-weight: bold;">setq</span> package-user-dir (expand-file-name <span style="font-style: italic;">"./.packages"</span>))
(<span style="font-weight: bold;">setq</span> package-archives '((<span style="font-style: italic;">"melpa"</span> . <span style="font-style: italic;">"https://melpa.org/packages/"</span>)
                         (<span style="font-style: italic;">"elpa"</span> . <span style="font-style: italic;">"https://elpa.gnu.org/packages/"</span>)))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Initialize the package system</span>
(package-initialize)
(<span style="font-weight: bold;">unless</span> package-archive-contents
  (package-refresh-contents))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Install dependencies</span>
(package-install 'htmlize)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Load the publishing system</span>
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">ox-publish</span>)


</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>Some general settings and HTML formatting.</label><pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> org-html-validation-link nil            <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Don't show validation link</span>
      org-src-fontify-natively t              <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">for code snippets</span>
      org-html-head-include-scripts nil       <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use our own scripts</span>
      org-html-head-include-default-style nil <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use our own styles</span>
      org-html-doctype <span style="font-style: italic;">"html5"</span>                <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use html5</span>
      org-html-html5-fancy t                  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">make it fancy looking</span>
      org-export-allow-bind-keywords t)       <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">so you can use '#+incluse I think'</span>


</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>The actual publish-project-alist config:</label><pre class="src src-emacs-lisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define the publishing project</span>
(<span style="font-weight: bold;">setq</span> org-publish-project-alist
      (list
       (list <span style="font-style: italic;">"index"</span>
             <span style="font-weight: bold;">:recursive</span> nil
             <span style="font-weight: bold;">:base-directory</span> <span style="font-style: italic;">"./content"</span>
             <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
             <span style="font-weight: bold;">:publishing-function</span> 'org-html-publish-to-html
             <span style="font-weight: bold;">:publishing-directory</span> <span style="font-style: italic;">"./public"</span>
             <span style="font-weight: bold;">:with-author</span> nil           <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Don't include author name</span>
             <span style="font-weight: bold;">:with-creator</span> t            <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Include Emacs and Org versions in footer</span>
             <span style="font-weight: bold;">:with-toc</span> nil                <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Include a table of contents</span>
             <span style="font-weight: bold;">:section-numbers</span> nil       <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Don't include section numbersi</span>
             <span style="font-weight: bold;">:html-head</span> <span style="font-style: italic;">"&lt;link rel=\"stylesheet\" href=\"style.css\" type=\"text/css\"/&gt; &lt;link rel=\"icon\" href=\"favicon.png\" type=\"image/x-icon\"/&gt;"</span>
             <span style="font-weight: bold;">:html-preamble</span> <span style="font-style: italic;">"&lt;div id=\"updated\"&gt;Updated: %C&lt;/div&gt;"</span>
             <span style="font-weight: bold;">:time-stamp-file</span> nil)
       (list <span style="font-style: italic;">"blog"</span>
             <span style="font-weight: bold;">:recursive</span> nil
             <span style="font-weight: bold;">:base-directory</span> <span style="font-style: italic;">"./content/blog"</span>
             <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
             <span style="font-weight: bold;">:publishing-function</span> 'org-html-publish-to-html
             <span style="font-weight: bold;">:publishing-directory</span> <span style="font-style: italic;">"./public/blog"</span>
             <span style="font-weight: bold;">:with-author</span> nil           <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Don't include author name</span>
             <span style="font-weight: bold;">:with-creator</span> t            <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Include Emacs and Org versions in footer</span>
             <span style="font-weight: bold;">:with-toc</span> nil                <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Include a table of contents</span>
             <span style="font-weight: bold;">:section-numbers</span> nil       <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Don't include section numbers</span>
             <span style="font-weight: bold;">:html-head</span> <span style="font-style: italic;">"&lt;link rel=\"stylesheet\" href=\"../style.css\" type=\"text/css\"/&gt; &lt;link rel=\"icon\" href=\"../favicon.png\" type=\"image/x-icon\"/&gt;"</span>
             <span style="font-weight: bold;">:html-preamble</span>  <span style="font-style: italic;">"&lt;nav&gt;</span>
<span style="font-style: italic;">  &lt;a href=\"../index.html\"&gt;&amp;lt; Home&lt;/a&gt;</span>
<span style="font-style: italic;">&lt;/nav&gt;</span>
<span style="font-style: italic;">&lt;div id=\"updated\"&gt;Updated: %C&lt;/div&gt;"</span>
             <span style="font-weight: bold;">:time-stamp-file</span> nil
             <span style="font-weight: bold;">:auto-sitemap</span> t
             <span style="font-weight: bold;">:sitemap-title</span> <span style="font-style: italic;">"Blog"</span>
             <span style="font-weight: bold;">:sitemap-filename</span> <span style="font-style: italic;">"blog.org"</span>
             <span style="font-weight: bold;">:sitemap-sort-files</span> 'anti-chronologically)
       (list <span style="font-style: italic;">"static"</span>
             <span style="font-weight: bold;">:recursive</span> t
             <span style="font-weight: bold;">:base-directory</span> <span style="font-style: italic;">"./content"</span>
             <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"css</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">txt</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">pdf</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">jpg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">jpeg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">gif</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">png"</span>
             <span style="font-weight: bold;">:publishing-function</span> 'org-publish-attachment
             <span style="font-weight: bold;">:publishing-directory</span> <span style="font-style: italic;">"./public"</span>)))    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Don't include time stamp in file</span>


</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>publish command and complete message:</label><pre class="src src-emacs-lisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Generate the site output</span>
(org-publish-all t)

(message <span style="font-style: italic;">"Build complete!"</span>)
<span style="font-weight: bold; font-style: italic;">;;; </span><span style="font-weight: bold; font-style: italic;">build-site.el ends here</span>

</pre>
</div>

<p>
Then I run the file with the shell script 'build.sh' which I copied 1:1 from SystemCrafters, see the sources for visiting his excellent website. The created html-files are saved in the 'public' folder. I then just manually push the directory onto github where 'public' is used as root directory for this page. If you want to do the same, I agein direct you to the excellent guide form SystemCrafters.net.
</p>
</div>
</div>

<div id="outline-container-orgd47adf2" class="outline-2">
<h2 id="orgd47adf2">Sources</h2>
<div class="outline-text-2" id="text-orgd47adf2">
<ul class="org-ul">
<li><a href="https://systemcrafters.net/publishing-websites-with-org-mode/building-the-site/">SystemCrafters.net</a></li>
<li><a href="https://taingram.org/blog/org-mode-blog.html">taingram.org</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-03-07 Tue 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
</div>
</body>
</html>
